Управление_пожарной_частью_/src/Documents/Выдача/Выдача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Выдача</name>
  <registerRecords>AccumulationRegister.ОстаткиИмуществаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.Остатки</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСотрудника</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/AccumulationRegisters/ОстаткиИмуществаСотрудников/ОстаткиИмуществаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиИмуществаСотрудников</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_пожарной_частью_/src/AccumulationRegisters/Остатки/Остатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Остатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>EnumRef.РазмерОдежды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_пожарной_частью_/src/Documents/Выдача/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиИмуществаСотрудников Приход
	Движения.ОстаткиИмуществаСотрудников.Записывать = Истина;
	Движения.ОстаткиИмуществаСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество из ВещевоеИмущество Цикл
		Движение = Движения.ОстаткиИмуществаСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Дата = Дата;
		Движение.Сотрудник = ФИОСотрудника;
		Движение.Наименование = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла;
	Движения.Остатки.Записывать = Истина;
	Для Каждого ТекСтрокаВещевоеИмущество Из ВещевоеИмущество Цикл
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;  
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаВещевоеИмущество.Наименование;
		Движение.Размер = ТекСтрокаВещевоеИмущество.Размер;
		Движение.Количество = ТекСтрокаВещевоеИмущество.Количество;
	КонецЦикла;
	 
    Если ФИОСотрудника = Неопределено Тогда
        Сообщить("Не выбран сотрудник!");
        Возврат;
    КонецЕсли;
    
    СотрудникОбъект = ФИОСотрудника.ПолучитьОбъект();
    
        Для Каждого СтрокаДокумента Из ВещевоеИмущество Цикл
        
        Найдено = Ложь;
        Для Каждого СтрокаСотрудника Из СотрудникОбъект.ВещевоеИмущество Цикл
            Если СтрокаСотрудника.Наименование = СтрокаДокумента.Наименование
               И СтрокаСотрудника.Размер = СтрокаДокумента.Размер Тогда
                Найдено = Истина;
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        Если Найдено Тогда
            Для Каждого СтрокаСотрудника Из СотрудникОбъект.ВещевоеИмущество Цикл
                Если СтрокаСотрудника.Наименование = СтрокаДокумента.Наименование
                   И СтрокаСотрудника.Размер = СтрокаДокумента.Размер Тогда
                    СтрокаСотрудника.ДатаСписания = СтрокаДокумента.ДатаСписания;
                КонецЕсли;
            КонецЦикла;
        Иначе
            НоваяСтрока = СотрудникОбъект.ВещевоеИмущество.Добавить();
            НоваяСтрока.Наименование = СтрокаДокумента.Наименование;
            НоваяСтрока.Размер = СтрокаДокумента.Размер;
            НоваяСтрока.Количество = СтрокаДокумента.Количество;
            НоваяСтрока.ДатаВыдачи = Дата; 
            НоваяСтрока.ДатаСписания = СтрокаДокумента.ДатаСписания;
        КонецЕсли;
        
    КонецЦикла;
        СотрудникОбъект.Записать();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры;
